[
	{
		"AdiSoyadi": "Mustafa Kemal ATATÜRK",
		"CumhurbaskanTarih": "29 Ekim 1923 - 10 Kasım 1938",
		"Aciklama": "<span> <b>Mustafa Kemal Atatürk<b> Türk asker, devlet adamı ve Türkiye Cumhuriyeti'nin <b> kurucusudur <b>.<br><br> Birinci Dünya Savaşı sırasında Osmanlı ordusunda görev yapan Atatürk; Çanakkale Cephesi'nde miralaylığa, Sina ve Filistin Cephesi'nde ise Yıldırım Orduları komutanlığına atandı. Savaşın sonunda Osmanlı İmparatorluğu'nun yenilgisini takiben Kurtuluş Savaşı ile simgelenen Türk Ulusal Hareketi'ne önderlik etti. Türk Kurtuluş Savaşı sürecinde Ankara Hükûmeti'ni kurdu, Türk Orduları Başkomutanı olarak Sakarya Meydan Muharebesi'ndeki başarısından dolayı 19 Eylül 1921 tarihinde Gazi unvanını aldı ve mareşalliğe yükseldi; askerî ve siyasi eylemleriyle İtilaf Devletleri ve destekçilerine karşı zafer kazandı. Savaşın ardından Cumhuriyet Halk Partisi'ni Halk Fırkası adıyla kurdu ve ilk genel başkanı oldu. 29 Ekim 1923'te cumhuriyetin ilanının akabinde cumhurbaşkanı seçildi. 1938'deki ölümüne dek dört dönem bu görevi yürüterek Türkiye'de en uzun süre cumhurbaşkanlığı yapmış kişi oldu.<br><br> </span>",
		"ResimUrl": "https://github.com/gulbincoskun/hr200005gulbincoskun/blob/main/ataturk.jpg?raw=true",
		"BannerUrl": "https://github.com/gulbincoskun/hr200005gulbincoskun/blob/main/banner_ataturk.jpg?raw=true"

	},
	{
		"AdiSoyadi": "İsmet İNÖNÜ",
		"CumhurbaskanTarih": "11 Kasım 1938 - 22 Mayıs 1950",
		"Aciklama": " <span> <b>Mustafa İsmet İnönü <b> Osmanlı döneminde albay, Cumhuriyet döneminde orgeneral ve eski Genelkurmay Başkanı olan, cumhuriyetin ilanından sonra Türkiye'nin ilk Başbakanı, <b> 2. <b> Cumhurbaşkanı, İstiklal Madalyası sahibi Türk asker ve siyasetçidir. <br><br> Cumhurbaşkanlığı görevini Mustafa Kemal Atatürk'ün vefatından 1 gün sonra 11 Kasım 1938'den 22 Mayıs 1950 tarihine kadar sürdürmüştür.CHP Kurultayı tarafından 'Milli Şef' unvanı verilmiştir.İnönü; Kurtuluş Savaşı'na katılmış, Lozan Antlaşması'nı imzalamış ve birçok defa başbakanlık görevini üstlenmiştir. 1925-1937 yılları arasında 12 yıllık kesintisiz başbakanlık süresi olmakla birlikte, toplam 17 yıl 11 ay ile Türkiye Cumhuriyeti tarihinin en uzun süre başbakanlık yapmış kişisidir. <br><br> </span>",
		"ResimUrl": "https://github.com/gulbincoskun/hr200005gulbincoskun/blob/main/ismetinonu.jpg?raw=true",
		"BannerUrl": "https://github.com/gulbincoskun/hr200005gulbincoskun/blob/main/banner_ismetinonu.jpg?raw=true"

	},
	{
		"AdiSoyadi": "Celâl BAYAR",
		"CumhurbaskanTarih": "22 Mayıs 1950 - 27 Mayıs 1960",
		"Aciklama": " <span> <b> Mahmud Celâleddin Bayar <b> (16 Mayıs 1883; Umurbey, Gemlik, Bursa - 22 Ağustos 1986, İstanbul), Türk ekonomist ve siyasetçi. <br><br> Çağdaş Türkiye'nin siyasi yaşamının çeşitli dönemlerinde önemli roller oynamış olan Bayar, Meclis-i Mebusan üyesi, cumhuriyet döneminde iktisat vekili, Mustafa Kemal Atatürk'ün son başbakanı ve 1950-1960 arasında Türkiye'nin <b> 3. <b> ve asker kökenli olmayan ilk cumhurbaşkanı olarak görev yaptı. <br><br> </span>",
		"ResimUrl": "https://github.com/gulbincoskun/hr200005gulbincoskun/blob/main/celalbayar.png?raw=true",
		"BannerUrl": "https://github.com/gulbincoskun/hr200005gulbincoskun/blob/main/banner_celalbayar.jpg?raw=true"

	},
	{
		"AdiSoyadi": "Cemal GÜRSEL",
		"CumhurbaskanTarih": "26 Ekim 1961 - 2 Şubat 1966",
		"Aciklama": " <span> <b> Cemal Gürsel <b> (10 Haziran 1895 – 14 Eylül 1966) Türk asker ve devlet adamı. <br><br> 1960 Darbesi sonrası oluşturulan Millî Birlik Komitesi Başkanı ve Türkiye Cumhuriyeti'nin <b> 4. <b> cumhurbaşkanıdır. <br><br> </span> ",
		"ResimUrl": "https://github.com/gulbincoskun/hr200005gulbincoskun/blob/main/cemalgursel.png?raw=true",
		"BannerUrl": "https://github.com/gulbincoskun/hr200005gulbincoskun/blob/main/banner_cemalgursel.jpg?raw=true"

	},
	{
		"AdiSoyadi": "Cevdet SUNAY",
		"CumhurbaskanTarih": "28 Mart 1966 - 28 Mart 1973",
		"Aciklama": " <span> <b> Ahmet Cevdet Sunay <b> (10 Şubat 1899 – 22 Mayıs 1982), Türk asker ve devlet adamı. <br><br> Türkiye'nin <b> 5. <b> Cumhurbaşkanı ve Türk Silahlı Kuvvetlerinin 12. Genelkurmay Başkanıdır.<br><br> </span>",
		"ResimUrl": "https://github.com/gulbincoskun/hr200005gulbincoskun/blob/main/cevdetsunay.jpg?raw=true",
		"BannerUrl": "https://github.com/gulbincoskun/hr200005gulbincoskun/blob/main/banner_cevdetsunay.jpg?raw=true"

	},
	{
		"AdiSoyadi": "Fahri KORUTÜRK",
		"CumhurbaskanTarih": "6 Nisan 1973 - 6 Nisan 1980",
		"Aciklama": "<span> <b> Fahri Sabit Korutürk <b> ya da Esseyit Hasan Fahri Korutürk (15 Ağustos 1903 – 12 Ekim 1987), Türk asker ve siyasetçi, eski Türk Deniz Kuvvetleri komutanı ve Türkiye'nin <b> 6. <b> Cumhurbaşkanı. <br><br> 1957–1960 yılları arasında Türk Deniz Kuvvetleri Komutanı olarak görev yapmış olan Korutürk, 1973–1980 yılları arasında Cumhurbaşkanlığı görevini sürdürmüştür. <br><br> </span>",
		"ResimUrl": "https://github.com/gulbincoskun/hr200005gulbincoskun/blob/main/fahrikoruturk.jpg?raw=true",
		"BannerUrl": "https://github.com/gulbincoskun/hr200005gulbincoskun/blob/main/banner_fahrikoruturk.jpg?raw=true"

	},
	{
		"AdiSoyadi": "Kenan EVREN",
		"CumhurbaskanTarih": "9 Kasım 1982 - 9 Kasım 1989",
		"Aciklama": "<span> <b> Ahmet Kenan Evren <b> (17 Temmuz 1917 – 9 Mayıs 2015), Türk asker, devlet adamı ve ressam. <br><br> Türk Silahlı Kuvvetlerinin 17. Genelkurmay Başkanı, 12 Eylül Darbesi sonrası Türkiye'nin Devlet Başkanı (1980-1982) ve <b> 7. <b> Cumhurbaşkanıdır (1982-1989). Ayrıca 1982 yılında kurulan Mehmetçik Vakfının kurucularındandır. 1998 yılında 'Atatürk' adlı yağlı boya tablosunun 105 milyar liraya satılmasıyla dönemin yaşayan en pahalı Türk ressamı olmuştur. <br><br> </span>",
		"ResimUrl": "https://github.com/gulbincoskun/hr200005gulbincoskun/blob/main/kenanevren.jpg?raw=true",
		"BannerUrl": "https://github.com/gulbincoskun/hr200005gulbincoskun/blob/main/banner_kenanevren.jpg?raw=true"

	},
	{
		"AdiSoyadi": "Turgut ÖZAL",
		"CumhurbaskanTarih": "9 Kasım 1989 - 17 Nisan 1993",
		"Aciklama": "<span> <b> Halil Turgut Özal <b> (13 Ekim 1927 – 17 Nisan 1993), Türk bürokrat, siyasetçi, mühendis ve devlet adamı, Türkiye Cumhuriyeti'nin <b> 8. <b> cumhurbaşkanı.<br><br> Bundan önce, 1983-1989 yılları arasında 5 yıl 10 ay boyunca başbakanlık ve aynı zamanda Anavatan Partisi genel başkanlığı görevlerinde bulunan Özal cumhurbaşkanlığı görevi sürerken ölen Mustafa Kemal Atatürk'ün ardından, görevi başında ölen ikinci cumhurbaşkanıdır.<br><br> </span>",
		"ResimUrl": "https://github.com/gulbincoskun/hr200005gulbincoskun/blob/main/turgutozal.jpg?raw=true",
		"BannerUrl": "https://github.com/gulbincoskun/hr200005gulbincoskun/blob/main/banner_turgutozal.jpg?raw=true"

	},
	{
		"AdiSoyadi": "Süleyman DEMİREL",
		"CumhurbaskanTarih": "16 Mayıs 1993 - 16 Mayıs 2000",
		"Aciklama": "<span> <b> Süleyman Sami Gündoğdu Demirel <b> (1 Kasım 1924 – 17 Haziran 2015), Türk mühendis ve siyasetçi, Türkiye'nin <b> 9. <b> cumhurbaşkanı. <br><br> Bundan önce, 1965-1993 yılları ​​arasında yedi farklı hükûmette toplam 10 yıl 5 aylık bir süreyle başbakanlık görevinde bulundu.yrıca 1964-1980 yılları arasında Adalet Partisi, 1987-1993 yılları arasında ise Doğru Yol Partisi genel başkanı olarak görev aldı. <br><br> </span> ",
		"ResimUrl": "https://github.com/gulbincoskun/hr200005gulbincoskun/blob/main/suleymandemirel.jpg?raw=true",
		"BannerUrl": "https://github.com/gulbincoskun/hr200005gulbincoskun/blob/main/banner_suleymandemirel.jpg?raw=true"

	},
	{
		"AdiSoyadi": "Ahmet Necdet SEZER",
		"CumhurbaskanTarih": "16 Mayıs 2000 - 28 Ağustos 2007",
		"Aciklama": "<span> <b> Ahmet Necdet Sezer <b> (d. 13 Eylül 1941; Afyonkarahisar), Türk hukukçu ve devlet adamı. <br><br> Türkiye'nin 14. Anayasa Mahkemesi başkanı ve <b> 10. <b> cumhurbaşkanıdır. Türkiye Cumhuriyeti tarihinde hem bir yüksek yürütme organının hem de bir yüksek yargı organının başkanlığını yapmış tek kişidir.1983 ile 1988 yılları arasında Yargıtay üyeliği yapan Sezer, 1988'den 1998'e kadar Anayasa Mahkemesi üyeliği, 1998 yılında da Anayasa Mahkemesi başkanlığı yaptı. 2000 Türkiye cumhurbaşkanlığı seçimi ile cumhurbaşkanlığı görevine seçildi. 2007 yılında cumhurbaşkanlığını Abdullah Gül'e devretti.<br><br> </span> ",
		"ResimUrl": "https://github.com/gulbincoskun/hr200005gulbincoskun/blob/main/ahmetnecdetsezer.jpg?raw=true",
		"BannerUrl": "https://github.com/gulbincoskun/hr200005gulbincoskun/blob/main/banner_ahmetnecdetsezer.jpg?raw=true"

	},
	{
		"AdiSoyadi": "Abdullah GÜL",
		"CumhurbaskanTarih": "28 Ağustos 2007 - 28 Ağustos 2014",
		"Aciklama": "<span> <b> Abdullah Gül <b> (d. 29 Ekim 1950, Kayseri), Türk siyasetçi, ekonomist ve Türkiye'nin <b> 11.<b>  Cumhurbaşkanı. <br><br> Cumhurbaşkanlığı görevini 2007–2014 yılları arasında sürdürmüştür.Bu görevinden önce 4 aylığına 2002–2003 yılları arasında Türkiye başbakanı olarak görev almıştır. 2003–2007 yılları arasında başbakan yardımcısı ve dışişleri bakanı olarak görev almıştır.Gül 1991, 1995, 1999, 2002 ve 2007 Türkiye genel seçimlerinde Kayseri milletvekili olarak meclise girdi.Başlangıçta Refah Partisi'ne katılmıştır fakat bu parti 1998 yılında laiklik Cumhuriyet ilkesine aykırı eylemlerinden dolayı kapatılınca Fazilet Partisi'ne katıldı. Fazilet Partisi 1. Olağan Kongresi'nde Genel Başkanlık için Recai Kutan ile yarıştı. 521 oy alarak 2. sırada kaldı ve Genel Başkan seçilemedi. Gül 2001 yılında kurulan Adalet ve Kalkınma Partisi'nin kurucular kurulu üyesi olarak Parti'nin kuruluşunda önemli rol oynadı.<br><br> </span> ",
		"ResimUrl": "https://github.com/gulbincoskun/hr200005gulbincoskun/blob/main/abdullahgul.jpg?raw=true",
		"BannerUrl": "https://github.com/gulbincoskun/hr200005gulbincoskun/blob/main/banner_abdullahgul.jpg?raw=true"

	},
	{
		"AdiSoyadi": "Recep Tayyip ERDOĞAN",
		"CumhurbaskanTarih": "28 Ağustos 2014 - Görevde",
		"Aciklama":  "<span> Hooks özelliği bir herhangi bir class yazmadan fonksiyonlar yardımıyla React’teki state ve lifecycle özelliklerinin kullanılmasını sağlar. Hook’lar class’lar içerisinde çalışmadığı için fonksiyon component’ı içerisinde yer almalıdırlar. React içerisinde halihazırda yer alan temel hook’lar olarak state hook ve effect hook’u örnek verebiliriz. <br>  <br>  <b>State Hook</b>  <br>  <br> useState() fonksiyonu aslında bir state hook. Bu hook’u, fonksiyon component’i içerisinde çağırıp içerisine istediğimiz state değişkenlerini atayabiliyoruz. Butona tıklanıp tekrar render edilme esnasında React bu state’i koruyor. useState iki değer return ediyor: <ul>    <li> Atanan mevcut değer. Bu mevcut değeri yani 0 değerini alıp adet değişkenine atamış oluyoruz. </li>    <li> Değeri değiştirme fonksiyonu. Bu fonksiyon ile yani adediAta fonksiyonuyla state’in ilgili değeri değiştirilebilir. Değiştirme fonksiyonu class component’larında kullanılan this.setState fonksiyonu gibi çalışır. Tek fark, this.setStatefonksiyonunda state eski state ile birleştirilir, değiştirme fonksiyonunda ise birleştirme yerine değiştirme (replace) işlemi uygulanır. </li>  </ul>  <br> useState‘in aldığı argüman başlangıç state’ini belirler. Yukarıdaki örnekteki 0 değerini, sayacın ilk başlangıç değeri olan 0’ın atanması için kullandık. Burada dikkat edecek olursak, this.state‘te yapılan obje atamalarına ek olarak state’e herhangi bir primitive değer ataması da gerçekleştirebiliyoruz. <br>  <br>  <b>Not:</b> Köşeli parantezlerle kullanılan atama işlemine array destructuring adı verilir ve bu sayede useState fonsiyonundan dönen array’in değerleri, köşeli parantez içerisinde yer alan değişkenlere atanır. <br>  <br>  <b>Effect Hook</b>  <br> React ile geliştirim yaptıysanız; sunucudan veri çekme, event abonelikleri, ve DOM’un manuel olarak değiştirilmesi gibi işlemleri gerçekleştirmiş olabilirsiniz. Bu tarz işlemlere side effects (yan etkili) işlemler adı verilir. Çünkü bu tarz yan etkiye sahip işlemler rendering esnasında tamamlanıp bitmezler ve diğer component’lere etki edebilirler. <br>  <br>useEffect fonksiyonu olarak tanımlanan Effect Hook, herhangi bir fonksiyon component’ine bu tarz yan etkili işlemleri yapabilme yeteneği kazandırır. React class’larındaki componentDidMount, componentDidUpdate, ve componentWillUnmount metodları ile aynı görevi yürütür ve bu metodları tek bir fonksiyon çatısı altında gerçekleştirir. <br>  <br>useEffect fonksiyonunu çağırdığınızda React’e “DOM ile ilgili işlemleri tamamladıktan sonra bu fonksiyonu çalıştır.” demiş oluyorsunuz. Effect’ler component içerisinde oluşturulur. Bu sayede component’in state’ine ve props özelliklerine erişim sağlayabilirler. React varsayılan olarak ilk render da dahil olmak üzere her render işleminden sonra effect fonksiyonunu çalıştırır. <br>  <br> Ayrıca Effect’ler, bir fonksiyon return ederek ilgili işlemin temizlenmesini sağlayabilirler. Aşağıdaki örnekteki component, effect kullanarak arkadaşın online durumuna abone olabiliyor, ve abonelikten çıkarak işlemi temizleyebiliyor. <br>  <br>  <b>Hook kullanımında dikkat edilmesi gereken hususlar</b>  <br> Hook’lar temelinde JavaScript fonksiyonudurlar. Fakat state ve lifecycle ile ilgili kısımlara da müdahale edebildikleri için aşağıdaki iki husus göz önüne alınarak kullanılmalıdır: <ul>    <li>Hook’lar component’in top-level kısmından çağrılmalıdırlar. Yani döngüler, if cümlecikleri veya iç içe fonksiyonlar içerisinde kullanılmamalıdırlar. </li>    <li> Hook’lar React’ın fonksiyonel component‘leri içerisinden çağrılmalıdırlar. Sıradan herhangi bir fonksiyon içerisinden çağrılmamalıdırlar. </li>  </ul></span> ",
		"ResimUrl": "https://github.com/gulbincoskun/hr200005gulbincoskun/blob/main/receptayyiperdogan.jpg?raw=true",
		"BannerUrl": "https://github.com/gulbincoskun/hr200005gulbincoskun/blob/main/banner_receptayyiperdegon.jpg?raw=true"

	}
]
